---
kind: property
id: P:Autodesk.Revit.DB.Lighting.InitialWattageIntensity.Wattage
source: html/3e602e58-3059-4c7f-f158-575d42984137.htm
---
# Autodesk.Revit.DB.Lighting.InitialWattageIntensity.Wattage Property

The wattage value.

## Syntax (C#)
```csharp
public double Wattage { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The wattage value is not valid because it is not between 0 and 1e+30.